archive/TDS Real-Time/20180412 1.0/TransactionListRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tran="https://services.ird.govt.nz/GWS/Transactions/" xmlns:ret="https://services.ird.govt.nz/GWS/Transactions/:types/RetrieveListRequest">
   <soap:Header/>
   <soap:Body>
      <tran:RetrieveList>
         <tran:RetrieveListRequestMsg>
            <ret:RetrieveListRequestWrapper>
                             <retrieveListRequest xmlns="urn:www.ird.govt.nz/GWS:types/Transactions">
                  <softwareProviderData xmlns="urn:www.ird.govt.nz/GWS:types/Common.v1">
                     <softwareProvider>SoftwareProvider</softwareProvider>
                     <softwarePlatform>SoftwarePlatform</softwarePlatform>
                     <softwareRelease>1</softwareRelease>
                  </softwareProviderData>
                  <identifier IdentifierValueType="ACCIRD" xmlns="urn:www.ird.govt.nz/GWS:types/Common.v1">011264190</identifier>
                  <accountType xmlns="urn:www.ird.govt.nz/GWS:types/Common.v1">GST</accountType>
                  <filingPeriod>2016-12-31</filingPeriod>
               </retrieveListRequest>

            </ret:RetrieveListRequestWrapper>
         </tran:RetrieveListRequestMsg>
      </tran:RetrieveList>
   </soap:Body>
</soap:Envelope>